AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

CommonModules/ОтменаПроведения/Ext/Module.bsl
Функция ОтказПроведения(НазваниеДокумента, НазваниеТаблицы, Ссылка, Склад, МоментВремени) Экспорт
	Отказ = Ложь;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	"+НазваниеДокумента+".Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ВТ_ДанныйОбъект
		|ИЗ
		|	Документ."+НазваниеДокумента+"."+НазваниеТаблицы+" КАК "+НазваниеДокумента+"
		|ГДЕ
		|	"+НазваниеДокумента+".Ссылка = &Ссылка
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыНаСкладахОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ВТ_ДанныйОбъект.Номенклатура КАК Номенклатура
		|ИЗ
		|	ВТ_ДанныйОбъект КАК ВТ_ДанныйОбъект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
		|				&Период,
		|				Склад = &Склад
		|					И Номенклатура В
		|						(ВЫБРАТЬ
		|							ВТ_ДанныйОбъект.Номенклатура КАК Номенклатура
		|						ИЗ
		|							ВТ_ДанныйОбъект КАК ВТ_ДанныйОбъект)) КАК ТоварыНаСкладахОстатки
		|		ПО (ТоварыНаСкладахОстатки.Номенклатура = ВТ_ДанныйОбъект.Номенклатура)
		|ГДЕ
		|	ТоварыНаСкладахОстатки.КоличествоОстаток < 0";
	
	Запрос.УстановитьПараметр("Период", Новый Граница(МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Сообщить("Недостаточно товара " + ВыборкаДетальныеЗаписи.Номенклатура + "! Не хватает " + (-ВыборкаДетальныеЗаписи.КоличествоОстаток) + "шт.");
		Отказ = Истина;
	КонецЦикла;
	Возврат Отказ;
КонецФункции
